In [2]:
import numpy as np
import pandas as pd

obj = pd.Series([4.5, 7.2, -5.3,3.6],
                index=['d','b','a','c'])

#利用reindex(),可以重新排序
obj.reindex(['a','b','c','d'])

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [4]:
#利用reindex(),可以過濾索引
obj.reindex(['a','b'])

a   -5.3
b    7.2
dtype: float64

In [5]:
obj2 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj2

0      blue
2    purple
4    yellow
dtype: object

In [6]:
obj2.reindex([0,2])

0      blue
2    purple
dtype: object

In [10]:
#dataFrame使用reindex()
frame=pd.DataFrame(np.arange(9).reshape(3,3),
             index=['a', 'c', 'd'],
             columns=['台北', '台中', '高雄'])
frame

   台北  台中  高雄
a   0   1   2
c   3   4   5
d   6   7   8

In [12]:
#重新排序索引和欄位,並且過濾索引和欄位
frame.reindex(index=['a','d','c'],columns=['高雄','台北'])

   高雄  台北
a   2   0
d   8   6
c   5   3

In [13]:
#drop()
obj = pd.Series(np.arange(5),index=['a', 'b', 'c', 'd', 'e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [14]:
#drop()1個index
obj.drop('c')

a    0
b    1
d    3
e    4
dtype: int64

In [15]:
#drop()->多個
obj.drop(['c','e'])

a    0
b    1
d    3
dtype: int64

In [16]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
                   index=['台北','台中', '台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [17]:
data.drop(index=['台北','台中'],columns=['four','three'])

    one  two
台南    8    9
高雄   12   13

In [18]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [19]:
obj['a']

0.0

In [20]:
obj[['a','d']]

a    0.0
d    3.0
dtype: float64

In [21]:
obj['a':'c']

a    0.0
b    1.0
c    2.0
dtype: float64

In [23]:
obj <= 2

a     True
b     True
c     True
d    False
dtype: bool

In [24]:
obj[obj<=2]

a    0.0
b    1.0
c    2.0
dtype: float64

In [26]:
#新增
obj['e'] = 4.0
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [27]:
#修改
obj['a'] = 0.5
obj

a    0.5
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [28]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['台北','台中','台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [31]:
#dataFrame,使用[],預設是選取欄位
data['one']

台北     0
台中     4
台南     8
高雄    12
Name: one, dtype: int64

In [32]:
data[['one','three']]

    one  three
台北    0      2
台中    4      6
台南    8     10
高雄   12     14

In [34]:
#DataFrame,使用slice[:],選取的是index
data['台北':'台北']

    one  two  three  four
台北    0    1      2     3

In [35]:
data['台北':'台南']

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11

In [37]:
#DataFrame使用loc[],可以同時,選取index和欄,使用label名稱
#loc[index,欄]
data.loc['台北','two']

1

In [39]:
data.loc[['台北','台中'],['two','four']]

    two  four
台北    1     3
台中    5     7

In [41]:
data.loc['台北':'台南']

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11

In [42]:
data.loc['台北':'台南','one':'three']

    one  two  three
台北    0    1      2
台中    4    5      6
台南    8    9     10

In [44]:
data.loc[:,'one':'three']

    one  two  three
台北    0    1      2
台中    4    5      6
台南    8    9     10
高雄   12   13     14